# GetPointLineZone Method (UV)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..GetPointLineZone Method (UV)
FillGrid Class See Also
---
Gets the index of fill grid line closest to the input 2d point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int GetPointLineZone(
	UV point
)
```

Visual Basic
---
```text
Public Function GetPointLineZone ( _
	point As UV _
) As Integer
```

Visual C++
---
```text
public:
int GetPointLineZone(
	UV^ point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB..::..UV Input point.
# ### Return Value
The index of fill grid line.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FillGrid Class
GetPointLineZone Overload
Autodesk.Revit.DB Namespace